FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ТТ_НастройкиКлиентБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТТ_НастройкиКлиентБанка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийКлиентБанк</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФОБренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФОПодразделениеУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФОПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ТТ_НастройкиКлиентБанка/Ext/ManagerModule.bsl
Функция НайтиЗапросом(Организация, Контрагент, ВидДвижения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТ_НастройкиКлиентБанка.Ссылка,
	|	ТТ_НастройкиКлиентБанка.НазначениеПлатежа,
	|	ТТ_НастройкиКлиентБанка.ПроцентКомиссии,
	|	ТТ_НастройкиКлиентБанка.ДоговорВзаиморасчетов,
	|	ТТ_НастройкиКлиентБанка.СтатьяДДС,
	|	ТТ_НастройкиКлиентБанка.СтатьяДоходовИРасходов,
	|	ТТ_НастройкиКлиентБанка.ЦФОБренд,
	|	ТТ_НастройкиКлиентБанка.ЦФОПодразделение
	|ИЗ
	|	Справочник.ТТ_НастройкиКлиентБанка КАК ТТ_НастройкиКлиентБанка
	|ГДЕ
	|	ТТ_НастройкиКлиентБанка.Организация = &Организация
	|	И ТТ_НастройкиКлиентБанка.Контрагент = &Контрагент
	|	И ТТ_НастройкиКлиентБанка.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФУнкции
